Обработки/Reports/_ОтчетОРезультатахДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОРезультатахДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючТекущегоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНачалаУправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьСЧАБезПослаблений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьАктивыИзРасчетаДоходности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокАктивовДляИсключенияИзРасчетаДоходности</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДепозитыРазвернуто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьЦБСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОРезультатахДоверительногоУправления/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период.ДатаОкончания	= НачалоДня(ТекущаяДата()) - 1;	
	Отчет.Период.ДатаНачала		= НачалоГода(Отчет.Период.ДатаОкончания);
	Отчет.НеУчитыватьЦБСделкиРЕПО = Ложь;
	
	Отчет.СписокАктивовДляИсключенияИзРасчетаДоходности.ТипЗначения = Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.Типы());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	ЗаполнитьСписокАктивовДляИсключенияИзРасчетаДоходности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период.Дата" + ?(Лев(ТекстСообщения, 9) = "Окончание" , "Окончания", "Начала"), Отказ); 	
	КонецЕсли; 
	
	Если Отчет.Период.ДатаОкончания > КонецДня(ТекущаяДата()) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания периода расчета не может быть больше текущей даты." + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"),,,"Отчет.Период.ДатаОкончания", Отказ);
	КонецЕсли;	
	
	Если ЭтаФорма.ФормироватьВВалютеСтратегии И Не ЗначениеЗаполнено(Отчет.ВалютаОтчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задана валюта отчета", , "Отчет.ВалютаОтчета", , Отказ);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета();	
	
	Отчет.СписокАктивовДляИсключенияИзРасчетаДоходности.Очистить();
	ЗаполнитьСписокАктивовДляИсключенияИзРасчетаДоходности();  	
	
КонецПроцедуры

&НаКлиенте
Процедура КлючТекущегоВариантаПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета();	
	
	ЗаполнитьСписокАктивовДляИсключенияИзРасчетаДоходности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета();	
	
	Отчет.СписокАктивовДляИсключенияИзРасчетаДоходности.ДоступныеЗначения = ПолучитьСписокЦенныхБумагПоСчетуНаДату(Отчет.Организация, Отчет.СчетДоверительногоУправления, Отчет.Период.ДатаНачала, Отчет.Период.ДатаОкончания, Отчет.СНачалаУправления);
	УдалитьНедоступныеЗначения(Отчет.СписокАктивовДляИсключенияИзРасчетаДоходности);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОтчетаПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета();	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьВВалютеСтратегииПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ФормироватьВВалютеСтратегии Тогда
		Отчет.ВалютаОтчета = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
	ПриИзмененииПараметровОтчета();	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьАктивыИзРасчетаДоходностиПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
	ЗаполнитьСписокАктивовДляИсключенияИзРасчетаДоходности();  
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВвестиПериод(Команда)
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период.ДатаНачала		= Отчет.Период.ДатаНачала;
	ДиалогВыбораПериода.Период.ДатаОкончания	= Отчет.Период.ДатаОкончания;
	
	Если ДиалогВыбораПериода.Редактировать() Тогда 
		Отчет.Период.ДатаНачала		= ДиалогВыбораПериода.Период.ДатаНачала;
		Отчет.Период.ДатаОкончания	= ДиалогВыбораПериода.Период.ДатаОкончания;
		
		ПриИзмененииПараметровОтчета();
	КонецЕсли;
	
	ЗаполнитьСписокАктивовДляИсключенияИзРасчетаДоходности();

КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	ДатаПервогоВвода = ПолучитьДатуПервогоВводаПоСчетуДУ(Отчет.Организация, Отчет.СчетДоверительногоУправления,Отчет.Период);
	Если ДатаПервогоВвода = Неопределено Тогда
		ПоказатьПредупреждение(, "По счету доверительного управления не зарегистрировано ни одного ввода.");
		Возврат;	
	КонецЕсли;
	
	Если ДатаПервогоВвода > Отчет.Период.ДатаНачала Тогда
		РезультатВопроса = Вопрос("Дата начала периода расчета выбрана ранее, чем дата первого ввода." + Символы.ПС + "Для формирования отчета период расчета будет изменен. Продолжить?", РежимДиалогаВопрос.ОКОтмена);
		Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
		Отчет.Период.ДатаНачала = ДатаПервогоВвода;
		
		Если Отчет.Период.ДатаНачала > Отчет.Период.ДатаОкончания Тогда
			Отчет.Период.ДатаОкончания = Мин(КонецМесяца(Отчет.Период.ДатаНачала), ТекущаяДата());	
		КонецЕсли;
		
	// Ищем ближайшую СЧА	
	//ИначеЕсли Отчет.Период.ДатаНачала > ДатаПервогоВвода Тогда 
	//	ДатаБлижайшейСЧА = ПолучитьДатуБлижайшейСЧА(Отчет.Организация, Отчет.СчетДоверительногоУправления, Отчет.Период.ДатаНачала);
	//	Если ДатаБлижайшейСЧА = Неопределено Тогда
	//		ПоказатьПредупреждение(, "Стоимость чистых активов на " + Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " и ранее не была зарегистрирована.");
	//		Возврат;	
	//	КонецЕсли;
	//	
	//	ДатаБлижайшейСЧА = ДатаБлижайшейСЧА + 86400; // т.к. СЧА регистрируется в конце дня, то это СЧА на начало следующего дня
	//	
	//	Если Отчет.Период.ДатаНачала <> ДатаБлижайшейСЧА Тогда
	//		ТекстВопроса = "Стоимость чистых активов на " + Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " не зарегистрирована, "
	//			+ "ближайшая регистрация выполнена " + Формат(ДатаБлижайшейСЧА, "ДФ=dd.MM.yyyy") + "."
	//			+ Символы.ПС + "Изменить дату начала периода расчета на " + Формат(ДатаБлижайшейСЧА, "ДФ=dd.MM.yyyy")+ "?";
	//		РезультатВопроса = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	//		Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
	//			Возврат;
	//		КонецЕсли;
	//		
	//		Отчет.Период.ДатаНачала = ДатаБлижайшейСЧА;
	//	КонецЕсли;
	КонецЕсли;

	Если Отчет.РассчитыватьСЧАБезПослаблений И Отчет.ИсключитьАктивыИзРасчетаДоходности Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя одновременно Рассчитывать СЧА без послаблений и Исключить активы из расчёта доходности");
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Отчет.ИсключитьАктивыИзРасчетаДоходности 
		И (Отчет.ВалютаОтчета <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль") 
		И ЗначениеЗаполнено(Отчет.ВалютаОтчета)) Тогда
		ПоказатьПредупреждение(, "Невозможно сформировать отчет с исключением активов из расчета доходности в валюте. Сформируйте отчет в рублях или без исключения активов из расчета доходности.",,"Невозможно сформировать отчет");
		Возврат;	
	КонецЕсли;
	
	ДанныеОтчета = Новый Структура;
	ДанныеОтчета.Вставить("Период", Отчет.Период);
	ДанныеОтчета.Вставить("Организация", Отчет.Организация);
	ДанныеОтчета.Вставить("СчетДоверительногоУправления", Отчет.СчетДоверительногоУправления);
	ДанныеОтчета.Вставить("СписокАктивовДляИсключенияИзРасчетаДоходности", Отчет.СписокАктивовДляИсключенияИзРасчетаДоходности);
	ДанныеОтчета.Вставить("ИсключитьАктивыИзРасчетаДоходности", Отчет.ИсключитьАктивыИзРасчетаДоходности);
	ДанныеОтчета.Вставить("Валюта", Отчет.ВалютаОтчета);

	ОбновитьТабличныйДокумент(ЭтаФорма.ДанныеРасшифровки, ДанныеОтчета, ЭтаФорма.МакетРасшифровки);
	
	СкомпоноватьРезультат();
КонецПроцедуры

#Область Служебные_и_вспомогательные_функции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	ДанныеОбъекта	= Форма.Отчет;
	Элементы		= Форма.Элементы;
	
	Элементы.ВалютаОтчета.Видимость = Форма.ФормироватьВВалютеСтратегии;
	Элементы.СписокАктивовДляИсключенияИзРасчетаДоходности.Видимость = ДанныеОбъекта.ИсключитьАктивыИзРасчетаДоходности;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровОтчета()
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокАктивовДляИсключенияИзРасчетаДоходности()
	
	Если Отчет.ИсключитьАктивыИзРасчетаДоходности Тогда
		Отчет.СписокАктивовДляИсключенияИзРасчетаДоходности.ДоступныеЗначения = ПолучитьСписокЦенныхБумагПоСчетуНаДату(Отчет.Организация, Отчет.СчетДоверительногоУправления, Отчет.Период.ДатаНачала, Отчет.Период.ДатаОкончания, Отчет.СНачалаУправления);
		УдалитьНедоступныеЗначения(Отчет.СписокАктивовДляИсключенияИзРасчетаДоходности);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуПервогоВводаПоСчетуДУ(Организация, СчетДоверительногоУправления,ПериодОтчета)
	
	Возврат РеквизитФормыВЗначение("Отчет").ПолучитьДатуПервогоВводаПоСчетуДУ(Организация, СчетДоверительногоУправления, ПериодОтчета);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуБлижайшейСЧА(Организация, СчетДоверительногоУправления, ДатаНачала)
	Перем ДатаБлижайшейСЧА;	

	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ФинансовыеПоказатели.Период КАК НачалоПериода
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|	И ФинансовыеПоказатели.Период < &ДатаНачала
		|УПОРЯДОЧИТЬ ПО
		|	ФинансовыеПоказатели.Период УБЫВ
		|");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ДатаБлижайшейСЧА = РезультатЗапроса.Выгрузить()[0].НачалоПериода;
	КонецЕсли;
	
	Возврат ДатаБлижайшейСЧА; 	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокЦенныхБумагПоСчетуНаДату(Организация, СчетДоверительногоУправления, ДатаНачала, ДатаОкончания, СНачалаУправления)

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаНачала",						ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",					ДатаОкончания);
	Запрос.УстановитьПараметр("СНачалаУправления",				СНачалаУправления);
	Запрос.УстановитьПараметр("ТипыАктивов",					Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.Типы());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК ЦеннаяБумага
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) В (&ТипыАктивов)
		|	И ВЫБОР
		|			КОГДА &СНачалаУправления
		|				ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период < &ДатаОкончания
		|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СтоимостьПереоценки.ЦеннаяБумага
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	СтоимостьПереоценки.Активность
		|	И СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ВЫБОР
		|			КОГДА &СНачалаУправления
		|				ТОГДА СтоимостьПереоценки.Период < &ДатаОкончания
		|			ИНАЧЕ СтоимостьПереоценки.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ";
	
	СписокЦенныхБумаг = Новый СписокЗначений;
	СписокЦенныхБумаг.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЦеннаяБумага"));
	СписокЦенныхБумаг.СортироватьПоЗначению();
	
	Возврат СписокЦенныхБумаг;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьНедоступныеЗначения(Список)

	Для Индекс = 1 - Список.Количество() По 0 Цикл
		Если Список.ДоступныеЗначения.НайтиПоЗначению(Список[-Индекс].Значение) = Неопределено Тогда
			Список.Удалить(-Индекс);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАктивовДляИсключенияИзРасчетаДоходностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Отчет.СписокАктивовДляИсключенияИзРасчетаДоходности.ДоступныеЗначения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В портефеле нет зарегистрированных бумаг на %1", Формат(Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yyyy")));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьТабличныйДокумент(ДанныеРасшифровки, ДанныеОтчета, Макет)
	
	ДанныеРасшифровки.Очистить();
	
	ПараметрыРасчетаДоходности = Новый Структура; 
	ПараметрыРасчетаДоходности.Вставить("Организация",					ДанныеОтчета.Организация);
	ПараметрыРасчетаДоходности.Вставить("СчетДоверительногоУправления",	ДанныеОтчета.СчетДоверительногоУправления);
	ПараметрыРасчетаДоходности.Вставить("ДатаНачала",					ДанныеОтчета.Период.ДатаНачала);
	ПараметрыРасчетаДоходности.Вставить("ДатаОкончания",				ДанныеОтчета.Период.ДатаОкончания);
	ПараметрыРасчетаДоходности.Вставить("УчитыватьНДФЛПоНачислению",	Истина);
	ПараметрыРасчетаДоходности.Вставить("РасшифровкаРасчета",			Истина);
	ПараметрыРасчетаДоходности.Вставить("МассивОшибок",					Новый Массив);
	
	Если ЗначениеЗаполнено(ДанныеОтчета.Валюта) Тогда	
		ПараметрыРасчетаДоходности.Вставить("ВалютаРасчета",			ДанныеОтчета.Валюта);
	КонецЕсли;
	
	Если ДанныеОтчета.ИсключитьАктивыИзРасчетаДоходности И ЗначениеЗаполнено(ДанныеОтчета.СписокАктивовДляИсключенияИзРасчетаДоходности) Тогда
		ПараметрыРасчетаДоходности.Вставить("ИсключитьАктивыИзРасчетаДоходности",				ДанныеОтчета.ИсключитьАктивыИзРасчетаДоходности);
		ПараметрыРасчетаДоходности.Вставить("СписокАктивовДляИсключенияИзРасчетаДоходности",	ДанныеОтчета.СписокАктивовДляИсключенияИзРасчетаДоходности);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
    ДеталиРасчета = Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьУправления(ПараметрыРасчетаДоходности, Ложь);
	
	//Вывод данных о вводах и выводах
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(
		ДеталиРасчета.Операции, 
		"_ВводыВыводы", 
		Запрос); 
	
	ВыборкаВводыВыводы = Запрос.МенеджерВременныхТаблиц.Таблицы["_ВводыВыводы"].ПолучитьДанные().Выбрать();

	ДанныеРасшифровки.Вывести(Макет.ПолучитьОбласть("Шапка"));
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	Пока ВыборкаВводыВыводы.Следующий() Цикл
		ОбластьСтроки.Параметры.Заполнить(ВыборкаВводыВыводы);
		ДанныеРасшифровки.Вывести(ОбластьСтроки);
	КонецЦикла;
	
	Если ДанныеОтчета.ИсключитьАктивыИзРасчетаДоходности И ЗначениеЗаполнено(ДанныеОтчета.СписокАктивовДляИсключенияИзРасчетаДоходности) Тогда 
		
		//Вывод Финансовых показателей
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(
			ДеталиРасчета.ФинансовыеПоказатели, 
			"_ФинансовыеПоказатели", 
			Запрос);
		
		ВыборкаФинансовыеПоказатели = Запрос.МенеджерВременныхТаблиц.Таблицы["_ФинансовыеПоказатели"].ПолучитьДанные().Выбрать();
		
		ДанныеРасшифровки.Вывести(Макет.ПолучитьОбласть("ШапкаСИсключением"));
		ОбластьСтрокаСИсключением = Макет.ПолучитьОбласть("СтрокаСИсключением");
		
		Пока ВыборкаФинансовыеПоказатели.Следующий() Цикл
			ОбластьСтрокаСИсключением.Параметры.Заполнить(ВыборкаФинансовыеПоказатели);
			ДанныеРасшифровки.Вывести(ОбластьСтрокаСИсключением);
		КонецЦикла;
		
		//Вывод детализированой стоимости исключаемых активов:	
		Если ДанныеОтчета.СписокАктивовДляИсключенияИзРасчетаДоходности.Количество() > 1 Тогда
			
			СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(
				ДеталиРасчета.СуммаАктивовДляИсключения, 
				"_СуммаАктивовДляИсключения", 
				Запрос);
				
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_СуммаАктивовДляИсключения.Период КАК Период,
				|	_СуммаАктивовДляИсключения.ЦеннаяБумага КАК ИсключаемыйАктив,
				|	СУММА(_СуммаАктивовДляИсключения.Сумма) КАК СЧА
				|ИЗ
				|	_СуммаАктивовДляИсключения КАК _СуммаАктивовДляИсключения
				|
				|СГРУППИРОВАТЬ ПО
				|	_СуммаАктивовДляИсключения.Период,
				|	_СуммаАктивовДляИсключения.ЦеннаяБумага
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период";
			
			ВыборкаСуммаАктивовДляИсключения = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаСуммаАктивовДляИсключения.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			ДанныеРасшифровки.Вывести(Макет.ПолучитьОбласть("ШапкаДетализацияСтоимостиАктивов"));
			ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаДетализацияСтоимостиАктивов");
			
			Пока ВыборкаСуммаАктивовДляИсключения.Следующий() Цикл
				ОбластьСтроки.Параметры.Заполнить(ВыборкаСуммаАктивовДляИсключения);
				ДанныеРасшифровки.Вывести(ОбластьСтроки);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
